//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*
Console.Write("Введите первое число: ");
double a = Convert.ToDouble(Console.ReadLine());
Console.Write("Введите второе число: ");
double b = Convert.ToDouble(Console.ReadLine());
double max = a;
double min = b;

if(max > min)
{
    Console.WriteLine("Наибольшее число: " + max);
    Console.WriteLine("Наименьшее число: " + min);
}

else 
{
    Console.WriteLine("Наибольшее число: " + min);
    Console.WriteLine("Наименьшее число: " + max);
}
*/

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/*
Console.Write("Введите первое число: ");
double a = Convert.ToDouble(Console.ReadLine());
Console.Write("Введите второе число: ");
double b = Convert.ToDouble(Console.ReadLine());
Console.Write("Введите третье число: ");
double c = Convert.ToDouble(Console.ReadLine());
double max = 0;
 
if(a > b)
{
    max = a;
}
else
{
    max = b;
}
 
if(max > c)
{
    
}
else 
{
    max = c;
}

Console.WriteLine("Наибольшее число: " + max);
*/